Revit 2026 API

# ItemFactoryBase Properties

---

The ItemFactoryBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace